# 1. Берем готовый официальный образ с Node.js (легковесная версия на базе Alpine Linux)
FROM node:18-alpine

# 2. Указываем рабочую папку внутри контейнера, где будет жить наш проект
WORKDIR /app

# 3. Копируем файлы со списками зависимостей
COPY package*.json ./

# 4. Запускаем установку чистых зависимостей внутри контейнера (установится только Express)
RUN npm install

# 5. Копируем весь остальной код нашего проекта в контейнер
COPY . .

# 6. Говорим Докеру, что контейнер будет слушать 3000-й порт
EXPOSE 3000

# 7. Главная команда, которая запустит приложение внутри контейнера
CMD ["node", "index.js"]